Autodesk.Revit.DB.TableView.GetCalculatedValueText(Autodesk.Revit.DB.SectionType,System.Int32,System.Int32)
Gets the calculated value text for a cell from the instance view.
sectionType:
The section type.
row:
The row.
column:
The column.
Returns:
The calculated value text.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The sectionType is not a valid type for this view.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given row number row is invalid.
-or-
The given column number column is invalid.
-or-
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.TableView.GetCalculatedValueName(Autodesk.Revit.DB.SectionType,System.Int32,System.Int32)
Gets the calculated value name for a cell from the template view.
sectionType:
The section type.
row:
The row.
column:
The column.
Returns:
The name of the calculated value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The sectionType is not a valid type for this view.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given row number row is invalid.
-or-
The given column number column is invalid.
-or-
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.TableView.GetCellText(Autodesk.Revit.DB.SectionType,System.Int32,System.Int32)
Gets the cell's text based on its type
sectionType:
The requested section type
row:
Row Number in the Section
column:
Column Number in the Section
Returns:
The text for the given cell
Throws Autodesk.Revit.Exceptions.ArgumentException:
The sectionType is not a valid type for this view.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given row number row is invalid.
-or-
The given column number column is invalid.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.TableView.GetAvailableParameters(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets a list of valid parameters for the specified category that can be used in the table view.
cda:
The document.
categoryId:
The specified element category id.
Returns:
The IDs of all valid parameters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.TableView.GetAvailableParameterCategories(Autodesk.Revit.DB.SectionType,System.Int32)
Get all available parameter categories.
sectionType:
The section the row lies in.
row:
The row.
Returns:
The available parameter categories.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The sectionType is not a valid type for this view.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given row number row is invalid.
-or-
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.TableView.IsValidSectionType(Autodesk.Revit.DB.SectionType)
Identifies if the section type is valid for this view.
Remarks:
Some TableViews do not contain all of the possible section types.  For
example, standard schedules have only a Heading and Body.
sectionType:
The section type.
Returns:
True if the Section Type is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.TableView.MaximumRowHeight
Gets the maximum row height

Autodesk.Revit.DB.TableView.MaximumColumnWidth
Gets the maximum column width

Autodesk.Revit.DB.TableView.MinimumRowHeight
Gets the minimum row height
Since:
2014

Autodesk.Revit.DB.TableView.MinimumColumnWidth
Gets the minimum column width
Since:
2014

Autodesk.Revit.DB.TableView.MaximumGridWidth
Gets the allowed maximum grid width
Since:
2014

Autodesk.Revit.DB.TableView.TargetId
the element id of the element that is being viewed
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.TableView
This represents a view that shows a table.
Most of the layout data for the table is contained in the TableData class.